Repository: wation/Mathaxy
Catalog: MathaxyAI/MathaxyAI-iOS/Mathaxy/Localization/*.lproj/Localizable.strings
Languages: ja, ko, pt, zh_hans, zh_hant

# app_name
source: Mathaxy
ja: 数学の銀河
ko: 수학 은하
pt: Math Galaxy
zh_hans: 数学银河
zh_hant: 數學銀河

source: OK
ko: 확인
zh_hans: 确定
zh_hant: 確定

source: Cancel
ja: キャンセル
ko: 취소
pt: Cancelar
zh_hans: 取消
zh_hant: 取消

source: Confirm
ja: 確認
ko: 확인
pt: Confirmar
zh_hans: 确认
zh_hant: 確認

source: Back
ja: 戻る
ko: 뒤로
pt: Voltar
zh_hans: 返回
zh_hant: 返回

source: Next
ja: 次へ
ko: 다음
pt: Próximo
zh_hans: 下一步
zh_hant: 下一步

source: Retry
ja: 再試行
ko: 다시 시도
pt: Tentar novamente
zh_hans: 重试
zh_hant: 重試

source: Save
ja: 保存
ko: 저장
pt: Salvar
zh_hans: 保存
zh_hant: 保存

source: Share
ja: 共有
ko: 공유
pt: Compartilhar
zh_hans: 分享
zh_hant: 分享

source: Settings
ja: 設定
ko: 설정
pt: Configurações
zh_hans: 设置
zh_hant: 設置

source: Achievement
ja: 実績
ko: 업적
pt: Conquista
zh_hans: 成就
zh_hant: 成就

source: Home
ja: ホーム
ko: 홈
pt: Início
zh_hans: 首页
zh_hant: 首頁

source: Guest Login
ja: ゲストログイン
ko: 게스트 로그인
pt: Entrar como convidado
zh_hans: 游客登录
zh_hant: 遊客登錄

source: Parent Bind
ja: 保護者連携
ko: 부모 연결
pt: Vincular com pais
zh_hans: 家长辅助绑定
zh_hant: 家長輔助綁定

# enter_nickname
source: Please enter nickname
ja: ニックネームを入力してください
ko: 닉네임을 입력하세요
pt: Digite seu apelido
zh_hans: 请输入昵称
zh_hant: 請輸入暱稱

source: Nickname
ja: ニックネーム
ko: 닉네임
pt: Apelido
zh_hans: 昵称
zh_hant: 暱稱

source: Welcome, %@!
ja: ようこそ、%@！
ko: 환영합니다, %@!
pt: Bem-vindo, %@!
zh_hans: 欢迎，%@！
zh_hant: 歡迎，%@！

source: Level
ja: レベル
ko: 레벨
pt: Nível
zh_hans: 关卡
zh_hant: 關卡

source: Question
ja: 問題
ko: 문제
pt: Pergunta
zh_hans: 题目
zh_hant: 題目

source: Time
ja: 時間
ko: 시간
pt: Tempo
zh_hans: 时间
zh_hant: 時間

source: Score
ja: スコア
ko: 점수
pt: Pontuação
zh_hans: 得分
zh_hant: 得分

source: Start Game
ja: ゲーム開始
ko: 게임 시작
pt: Iniciar jogo
zh_hans: 开始游戏
zh_hant: 開始遊戲

source: Continue Game
ja: ゲーム続行
ko: 게임 계속
pt: Continuar jogo
zh_hans: 继续游戏
zh_hant: 繼續遊戲

source: Level Select
ja: レベル選択
ko: 레벨 선택
pt: Selecionar nível
zh_hans: 关卡选择
zh_hant: 關卡選擇

source: Current Level
ja: 現在のレベル
ko: 현재 레벨
pt: Nível atual
zh_hans: 当前关卡
zh_hant: 當前關卡

source: Unlocked
ja: 解放済み
ko: 해금됨
pt: Desbloqueado
zh_hans: 已解锁
zh_hant: 已解鎖

source: Locked
ja: ロック中
ko: 잠김
pt: Bloqueado
zh_hans: 未解锁
zh_hant: 未解鎖

source: Completed
ja: 完了
ko: 완료
pt: Concluído
zh_hans: 已完成
zh_hant: 已完成

source: Level Description
ja: レベル説明
ko: 레벨 설명
pt: Descrição do nível
zh_hans: 关卡描述
zh_hant: 關卡描述

source: Total Time Mode
ja: 総時間モード
ko: 총 시간 모드
pt: Modo de tempo total
zh_hans: 总时长模式
zh_hant: 總時長模式

source: Per Question Mode
ja: 1問当たりカウントダウンモード
ko: 문제당 카운트다운 모드
pt: Modo de contagem regressiva por pergunta
zh_hans: 单题倒计时模式
zh_hant: 單題倒計時模式

source: minutes
ja: 分
ko: 분
pt: minutos
zh_hans: 分钟
zh_hant: 分鐘

source: seconds
ja: 秒
ko: 초
pt: segundos
zh_hans: 秒
zh_hant: 秒

source: per question
ja: 1問当たり
ko: 문제당
pt: por pergunta
zh_hans: 每题
zh_hant: 每題

source: Congratulations!
ja: クリアおめでとう！
ko: 클리어 축하합니다!
pt: Parabéns por concluir!
zh_hans: 恭喜通关！
zh_hant: 恭喜通關！

# try_again
source: So close!
ja: 惜しかった！
ko: 아쉬워요!
pt: Quase lá!
zh_hans: 差一点哦！
zh_hant: 差一點哦！

# completed_level
source: Completed Level %d
ja: レベル %d クリア
ko: 레벨 %d 완료
pt: Nível %d concluído
zh_hans: 已完成第 %d 关
zh_hant: 已完成第 %d 關

# failed_level
source: Failed Level %d
ja: レベル %d 失敗
ko: 레벨 %d 실패
pt: Nível %d falhou
zh_hans: 第 %d 关失败
zh_hant: 第 %d 關失敗

# correct_count
source: Correct: %d
ja: 正解
ko: 정답
pt: Corretas：
zh_hans: 正确：%d
zh_hant: 正確

# error_count
source: Errors: %d
ja: 誤り：%d
ko: 오답: %d
pt: Erros: %d
zh_hans: 错误：%d
zh_hant: 錯誤：%d

source: Total Time: %@
ja: 総使用時間：%@
ko: 총 사용 시간: %@
pt: Tempo total: %@
zh_hans: 总用时：%@
zh_hant: 總用時：%@

# accuracy
source: Accuracy: %.0f%%
ja: 正解率：
ko: 정답률:
pt: Precisão:
zh_hans: 正确率：%.0f%%
zh_hant: 正確率：

source: Earned Badge
ja: バッジ獲得
ko: 뱃지 획득
pt: Conquista obtida
zh_hans: 获得勋章
zh_hant: 獲得勳章

# watch_ad_retry
source: Watch 30s Ad → Retry Level
ja: 30秒広告を視聴→このレベルを再チャレンジ
ko: 30초 광고 보기 → 이 레벨 다시 도전
pt: Assista a um anúncio de 30 segundos → Tentar novamente este nível
zh_hans: 观看30秒广告→重新挑战本关
zh_hant: 觀看30秒廣告→重新挑戰本關

# back_to_home
source: Back to Home → Try Later
ja: ホームに戻る→後で再チャレンジ
ko: 홈으로 돌아가기 → 나중에 다시 도전
pt: Voltar ao início → Tentar novamente mais tarde
zh_hans: 返回首页→下次再试
zh_hant: 返回首頁→下次再試

# ad_duration
source: Ad Duration: 30s
ja: 広告時間：30秒
ko: 광고 시간: 30초
pt: Duração do anúncio: 30 segundos
zh_hans: 广告时长：30秒
zh_hant: 廣告時長：30秒

# ad_description
source: Watch an ad to retry this level
ja: 広告を視聴するとこのレベルを再チャレンジできます
ko: 광고를 보면 이 레벨을 다시 도전할 수 있습니다
pt: Assistir a um anúncio permite que você tente novamente este nível
zh_hans: 观看广告后可以重新挑战本关卡
zh_hant: 觀看廣告後可以重新挑戰本關卡

source: Skip Level
ja: レベルスキップ
ko: 레벨 건너뛰기
pt: Pular nível
zh_hans: 跳关
zh_hant: 跳關

# skip_level_success
source: Great job! You skipped 3 levels!
ja: すばらしい！3つのレベルをスキップしました！
ko: 멋져! 3개의 레벨을 건너뛰었어요!
pt: Ótimo! Você pulou 3 níveis!
zh_hans: 太棒了！你成功跳过了3关！
zh_hant: 太棒了！你成功跳過了3關！

# skip_to_level
source: Skip to Level %d
ja: レベル %d にスキップ
ko: 레벨 %d로 건너뛰기
pt: Pular para o nível %d
zh_hans: 跳至第 %d 关
zh_hant: 跳至第 %d 關

source: Badge
ja: バッジ
ko: 뱃지
pt: Insígnia
zh_hans: 勋章
zh_hant: 勳章

source: Badges
ja: バッジ
ko: 뱃지
pt: Insígnias
zh_hans: 勋章
zh_hant: 勳章

source: Earned Badges
ja: 獲得したバッジ
ko: 획득한 뱃지
pt: Insígnias obtidas
zh_hans: 已获得勋章
zh_hant: 已獲得勳章

source: Total Badges
ja: 総バッジ数
ko: 총 뱃지
pt: Total de insígnias
zh_hans: 总勋章
zh_hant: 總勳章

# level_complete_badge
source: Addition Warrior
ja: 加法の勇者
ko: 덧셈 용사
pt: Guerreiro da adição
zh_hans: 加法小勇士
zh_hant: 加法小勇士

# skip_level_badge
source: Speed Master
ja: 神速のエキスパート
ko: 신속한 전문가
pt: Especialista rápido
zh_hans: 神速小能手
zh_hant: 神速小能手

# perfect_level_badge
source: Quiz Genius
ja: 完璧な回答の天才
ko: 완벽한 답변 천재
pt: Gênio das respostas perfeitas
zh_hans: 答题小天才
zh_hant: 答題小天才

# consecutive_login_badge
source: Persistence Master
ja: 継続の達人
ko: 지속하는 달인
pt: Mestre da constância
zh_hans: 坚持小达人
zh_hant: 堅持小達人

source: Guide Character
ja: ガイドキャラクター
ko: 가이드 캐릭터
pt: Personagem guia
zh_hans: 卡通向导
zh_hant: 卡通嚮導

# panda
source: Galaxy Panda
ja: 銀河パンダ
ko: 은하 팬더
pt: Panda galáctico
zh_hans: 银河小熊猫
zh_hant: 銀河小熊貓

# rabbit
source: Galaxy Rabbit
ja: 銀河ウサギ
ko: 은하 토끼
pt: Coelho galáctico
zh_hans: 银河小兔子
zh_hant: 銀河小兔子

source: Unlock Character
ja: キャラクターを解放
ko: 캐릭터 해금
pt: Desbloquear personagem
zh_hans: 解锁角色
zh_hant: 解鎖角色

# unlock_threshold
source: Requires %d badges to unlock
ja: %d バッジで解放
ko: %d개의 뱃지로 해금
pt: Você precisa de %d insígnias para desbloquear
zh_hans: 需要 %d 枚勋章解锁
zh_hant: 需要 %d 枚勳章解鎖

source: Character Message
ja: キャラクターメッセージ
ko: 캐릭터 메시지
pt: Mensagem do personagem
zh_hans: 角色消息
zh_hant: 角色消息

# consecutive_login
source: 7-Day Login Streak
ja: 7日間連続ログイン
ko: 7일 연속 로그인
pt: 7 dias consecutivos de login
zh_hans: 连续登录7天
zh_hant: 連續登錄7天

# consecutive_days
source: Logged in %d/%d days in a row
ja: 連続 %d/%d 日ログイン
ko: 연속 %d/%d일 로그인
pt: %d/%d dias consecutivos de login
zh_hans: 已连续登录 %d/%d 天
zh_hant: 已連續登錄 %d/%d 天

source: Login Streak
ja: ログインストリーク
ko: 로그인 스트릭
pt: Sequência de login
zh_hans: 登录连续天数
zh_hant: 登錄連續天數

source: Keep going!
ja: 頑張れ！
ko: 계속加油!
pt: Continue assim!
zh_hans: 继续加油！
zh_hant: 繼續加油！

source: Certificate
ja: 証明書
ko: 증명서
pt: Certificado
zh_hans: 奖状
zh_hant: 獎狀

source: Electronic Certificate
ja: 電子証明書
ko: 전자 증명서
pt: Certificado eletrônico
zh_hans: 电子奖状
zh_hant: 電子獎狀

source: Save to Album
ja: アルバムに保存
ko: 앨범에 저장
pt: Salvar no álbum
zh_hans: 保存到相册
zh_hant: 保存到相冊

source: Share to Social
ja: SNSに共有
ko: SNS에 공유
pt: Compartilhar nas redes sociais
zh_hans: 分享到社交平台
zh_hant: 分享到社交平台

# print_hint
source: You can print it as a paper certificate!
ja: 印刷して紙の証明書にできます！
ko: 인쇄하여 종이 증명서로 만들 수 있습니다!
pt: Você pode imprimir como certificado em papel!
zh_hans: 可打印成纸质奖状哦！
zh_hant: 可打印成紙質獎狀哦！

# certificate_title
source: Mathaxy Addition Master
ja: Mathaxy 加法マスター
ko: Mathaxy 덧셈 마스터
pt: Mathaxy Mestre da adição
zh_hans: Mathaxy 加法大师
zh_hant: Mathaxy 加法大師

# certificate_nickname
source: Nickname
ja: ニックネーム
ko: 닉네임
pt: Apelido
zh_hans: 昵称
zh_hant: 暱稱

# certificate_time
source: Total Completion Time
ja: 総クリア時間
ko: 총 클리어 시간
pt: Tempo total de conclusão
zh_hans: 通关总用时
zh_hant: 通關總用時

# certificate_badges
source: Badges Earned
ja: 獲得バッジ
ko: 획득 뱃지
pt: Insígnias obtidas
zh_hans: 获得勋章
zh_hant: 獲得勳章

source: Language Settings
ja: 言語設定
ko: 언어 설정
pt: Configurações de idioma
zh_hans: 语言设置
zh_hant: 語言設置

source: Sound Settings
ja: サウンド設定
ko: 사운드 설정
pt: Configurações de som
zh_hans: 音效设置
zh_hant: 音效設置

source: Music Settings
ja: 音楽設定
ko: 음악 설정
pt: Configurações de música
zh_hans: 音乐设置
zh_hant: 音樂設置

source: Haptic Settings
ja: ハプティック設定
ko: 햅틱 설정
pt: Configurações de vibração
zh_hans: 震动设置
zh_hant: 震動設置

source: About App
ja: アプリについて
ko: 앱 정보
pt: Sobre o aplicativo
zh_hans: 关于应用
zh_hant: 關於應用

source: Version
ja: バージョン
ko: 버전
pt: Versão
zh_hans: 版本
zh_hant: 版本

source: Reset Data
ja: データリセット
ko: 데이터 초기화
pt: Redefinir dados
zh_hans: 重置数据
zh_hant: 重置數據

# reset_data_warning
source: Are you sure you want to reset all data? This action cannot be undone!
ja: すべてのデータをリセットしますか？この操作は元に戻せません！
ko: 모든 데이터를 초기화하시겠습니까? 이 작업은 되돌릴 수 없습니다!
pt: Tem certeza que deseja redefinir todos os dados? Esta operação não pode ser desfeita!
zh_hans: 确定要重置所有数据吗？此操作不可撤销！
zh_hant: 確定要重置所有數據嗎？此操作不可撤銷！

# reset_data_confirm
source: Confirm Reset
ja: データをリセット
ko: 데이터 초기화
pt: Redefinir dados
zh_hans: 确定重置
zh_hant: 確定重置

source: Correct
ja: 正解
ko: 정답
pt: Correto
zh_hans: 答对
zh_hant: 答對

source: Incorrect
ja: 不正解
ko: 오답
pt: Incorreto
zh_hans: 答错
zh_hant: 答錯

source: Correct Answer
ja: 正解の答え
ko: 정답 답안
pt: Resposta correta
zh_hans: 正确答案
zh_hant: 正確答案

source: Timeout
ja: タイムアウト
ko: 시간 초과
pt: Tempo esgotado
zh_hans: 超时
zh_hant: 超時

source: Badge Earned
ja: バッジ獲得
ko: 뱃지 획득
pt: Insígnia obtida
zh_hans: 获得勋章
zh_hant: 獲得勳章

source: Character Unlocked
ja: キャラクター解放
ko: 캐릭터 해금
pt: Personagem desbloqueado
zh_hans: 解锁角色
zh_hant: 解鎖角色

source: Photo Library Permission
ja: フォトライブラリー権限
ko: 사진 라이브러리 권한
pt: Permissão de acesso à biblioteca de fotos
zh_hans: 相册访问权限
zh_hant: 相冊訪問權限

# photo_library_permission_description
source: Photo library access is needed to save certificate images
ja: 証明書の写真を保存するにはフォトライブラリーのアクセス権限が必要です
ko: 증명서 사진을 저장하려면 사진 라이브러리 접근 권한이 필요합니다
pt: É necessária permissão de acesso à biblioteca de fotos para salvar a imagem do certificado
zh_hans: 需要相册访问权限来保存奖状图片
zh_hant: 需要相冊訪問權限來保存獎狀圖片

source: Permission Denied
ja: 権限が拒否されました
ko: 권한이 거부되었습니다
pt: Permissão negada
zh_hans: 权限被拒绝
zh_hant: 權限被拒絕

source: Go to Settings
ja: 設定に移動
ko: 설정으로 이동
pt: Ir para configurações
zh_hans: 前往设置
zh_hant: 前往設置

source: Loading...
ja: 読み込み中...
ko: 로딩 중...
pt: Carregando...
zh_hans: 加载中...
zh_hant: 加載中...

source: Please wait...
ja: お待ちください...
ko: 잠시만 기다려 주세요...
pt: Por favor, aguarde...
zh_hans: 请稍候...
zh_hant: 請稍候...

source: No Data
ja: データがありません
ko: 데이터가 없습니다
pt: Nenhum dado
zh_hans: 暂无数据
zh_hant: 暫無數據

# error_occurred
source: An error occurred
ja: エラーが発生しました
ko: 오류가 발생했습니다
pt: Ocorreu um erro
zh_hans: 发生错误
zh_hant: 發生錯誤

source: Network Error
ja: ネットワークエラー
ko: 네트워크 오류
pt: Erro de rede
zh_hans: 网络错误
zh_hant: 網絡錯誤

source: Success
ja: 成功
ko: 성공
pt: Sucesso
zh_hans: 成功
zh_hant: 成功

source: Failed
ja: 失敗
ko: 실패
pt: Falhou
zh_hans: 失败
zh_hant: 失敗

source: Close
ja: 閉じる
ko: 닫기
pt: Fechar
zh_hans: 关闭
zh_hant: 關閉

source: Done
ja: 完了
ko: 완료
pt: Concluído
zh_hans: 完成
zh_hant: 完成

# retry_current_level
source: Try this level again to improve your score!
ja: 現在のレベルを再チャレンジしてスコアを向上させましょう！
ko: 현재 레벨을 다시 도전하여 점수를 향상시켜 보세요!
pt: Tente novamente o nível atual para melhorar sua pontuação!
zh_hans: 重试当前关卡以提高分数！
zh_hant: 重試當前關卡以提高分數！

# try_next_level
source: Great job! Try Level %d next.
ja: よくできました！次はレベル %d を試してみましょう。
ko: 잘했어요! 다음은 레벨 %d를 시도해 보세요.
pt: Bom trabalho! Tente o nível %d a seguir.
zh_hans: 干得好！接下来试试第 %d 关。
zh_hant: 幹得好！接下來試試第 %d 關。

# all_levels_completed
source: Congratulations! You have completed all levels.
ja: おめでとう！すべてのレベルをクリアしました。
ko: 축하합니다! 모든 레벨을 클리어했어요.
pt: Parabéns! Você concluiu todos os níveis.
zh_hans: 恭喜！你已完成所有关卡。
zh_hant: 恭喜！你已完成所有關卡。
